 gcc -g p1final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7cf: file p1final.c, line 20.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted
n
Breakpoint 1, main () at p1final.c:20
20  {
(gdb) n
22    input(&base,&height);
(gdb) s
input (base=0x7ffcc389e63c, height=0x7ffcc389e640) at p1final.c:5
5     printf("Enter Value: ");
(gdb) n
6     scanf("%f%f",base,height);
(gdb) n
Enter Value: 7.5
7.8
7   }
(gdb) p base
$1 = (float *) 0x7ffcc389e63c
(gdb) p *base
$2 = 7.5
(gdb) n
main () at p1final.c:23
23    find_area(base,height,&area);
(gdb) s
find_area (base=7.5, height=7.80000019, area=0x7ffcc389e644) at p1final.c:11
11    *area=.5*(base*height);
(gdb) n
12  }
(gdb) p *area
$3 = 29.25
(gdb) n
main () at p1final.c:24
24    output(base,height,area);
(gdb) n
The area of the triangle with base 7.500000 and height 7.800000 is 29.250000
25  }(gdb) c
Continuing.
[Inferior 1 (process 98) exited normally]
(gdb) 