 gcc -g p6final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x811: file p6final.c, line 29.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6final.c:29
29  {
(gdb) n
31    input_string(str);
(gdb) s
input_string (a=0x7ffd2ab81404 "\300U") at p6final.c:5
5     printf("Enter the string: ");
(gdb) n
6     scanf("%s", a);
(gdb) n
Enter the string: pirate
7   }
(gdb) p a
$1 = 0x7ffd2ab81404 "pirate"
(gdb) p *a
$2 = 112 'p'
(gdb) n
main () at p6final.c:33
33    str_reverse(str, rev_str);
(gdb) s
str_reverse (str=0x7ffd2ab81404 "pirate", rev_str=0x7ffd2ab8140e "")
    at p6final.c:12
12    for (n = 0; str[n]; n++);
(gdb) n
13    n--;
(gdb) n
15    for (i = 0; str[i]; i++)
(gdb) n
17      rev_str[i] = str[n];
(gdb) n
18      n--;
(gdb) n
15    for (i = 0; str[i]; i++)
(gdb) nn
Undefined command: "nn".  Try "help".
(gdb) n
17      rev_str[i] = str[n];
(gdb) n
18      n--;
(gdb) n
15    for (i = 0; str[i]; i++)
(gdb) p n
$3 = 3
(gdb) p str[n]
$4 = 97 'a'
(gdb) p rev_str
$5 = 0x7ffd2ab8140e "et"
(gdb) p str
$6 = 0x7ffd2ab81404 "pirate"
(gdb) finish
Run till exit from #0  str_reverse (str=0x7ffd2ab81404 "pirate", 
    rev_str=0x7ffd2ab8140e "et") at p6final.c:15
main () at p6final.c:34
34    output(str, rev_str);
(gdb) c
Continuing.
The reverse of pirate is etarip
[Inferior 1 (process 242) exited normally]
(gdb) 